Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаЗадолженностейДляБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаЗадолженностейДляБухгалтерии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>d7p1:TextDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаЗадолженностейДляБухгалтерии/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	ОбновитьНачисленияЗадолженности();
	
КонецПроцедуры


#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Объект.КаталогВыгрузки; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Объект.КаталогВыгрузки = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.КаталогВыгрузки + "\");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитОтбораПриИзменении(Элемент)
	
	ОбновитьНачисленияЗадолженности();
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаСервере
Процедура ОбновитьНачисленияЗадолженности()
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		ЭтаФорма.НачисленияЗадолженности.Очистить();
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияЗадолженности.НачислениеЗадолженности КАК НачислениеЗадолженности,
		|	НачисленияЗадолженности.Выгружать КАК Выгружать,
		|	НачисленияЗадолженности.Сумма КАК Сумма,
		|	НачисленияЗадолженности.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ВТ_НачисленияЗадолженности
		|ИЗ
		|	&НачисленияЗадолженности КАК НачисленияЗадолженности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВТ_НачисленияЗадолженности.Выгружать, ЛОЖЬ) КАК Выгружать,
		|	СУММА(НачислениеЗадолженностиОснования.Сумма) КАК Сумма,
		|	НачислениеЗадолженностиОснования.Ссылка КАК НачислениеЗадолженности,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
		|	НачислениеЗадолженностиОснования.Ссылка.Контрагент КАК Контрагент,
		|	НачислениеЗадолженностиОснования.Ссылка.Договор КАК Договор,
		|	НачислениеЗадолженностиОснования.Ссылка.Валюта КАК Валюта
		|ИЗ
		|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачисленияЗадолженности КАК ВТ_НачисленияЗадолженности
		|		ПО НачислениеЗадолженностиОснования.Ссылка = ВТ_НачисленияЗадолженности.НачислениеЗадолженности
		|			И НачислениеЗадолженностиОснования.Ссылка.Контрагент = ВТ_НачисленияЗадолженности.Контрагент
		|			И НачислениеЗадолженностиОснования.Сумма = ВТ_НачисленияЗадолженности.Сумма
		|ГДЕ
		|	НачислениеЗадолженностиОснования.Ссылка.Проведен
		|	И НачислениеЗадолженностиОснования.Ссылка.Организация = &Организация
		|	И НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности В(&ВидыЗадолженности)
		|	И (&Контрагент = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ИЛИ НачислениеЗадолженностиОснования.Ссылка.Контрагент = &Контрагент)
		|	И (&СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка)
		|			ИЛИ НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|	И НачислениеЗадолженностиОснования.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ВТ_НачисленияЗадолженности.Выгружать, ЛОЖЬ),
		|	НачислениеЗадолженностиОснования.Ссылка,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности,
		|	НачислениеЗадолженностиОснования.Ссылка.Контрагент,
		|	НачислениеЗадолженностиОснования.Ссылка.Договор,
		|	НачислениеЗадолженностиОснования.Ссылка.Валюта";
	
		Запрос.УстановитьПараметр("ДатаНачала"					, Объект.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания"				, Объект.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Организация"					, Объект.Организация);
		Запрос.УстановитьПараметр("ВидыЗадолженности"			, ЭтаФорма.ВидыЗадолженностей.ВыгрузитьЗначения());
		Запрос.УстановитьПараметр("Контрагент"					, Объект.Контрагент);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("НачисленияЗадолженности"		, ЭтаФорма.НачисленияЗадолженности.Выгрузить());
		
		ЭтаФорма.НачисленияЗадолженности.Очистить();
		ЭтаФорма.НачисленияЗадолженности.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура НачисленияЗадолженностиУправлениеФлажками(Команда)
	
	Для Каждого СтрокаНачисленияЗадолженности Из ЭтаФорма.НачисленияЗадолженности Цикл
		СтрокаНачисленияЗадолженности.Выгружать = (Команда = ЭтаФорма.Команды.НачисленияЗадолженностиУстановитьФлажки);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияЗадолженностиОтбор(Команда)
	
	ТекущиеДанные = Элементы.НачисленияЗадолженности.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если Элементы.НачисленияЗадолженности.ТекущийЭлемент = Элементы.НачисленияЗадолженностиВидЗадолженности Тогда
			ЭтаФорма.ВидыЗадолженностей.Очистить();
			ЭтаФорма.ВидыЗадолженностей.Добавить(ТекущиеДанные.ВидЗадолженности);
		Иначе
			ИмяПоля = СтрЗаменить(Элементы.НачисленияЗадолженности.ТекущийЭлемент.Имя, "НачисленияЗадолженности", "");
			Объект[ИмяПоля] = ТекущиеДанные[ИмяПоля];
		КонецЕсли;
		ОбновитьНачисленияЗадолженности();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияЗадолженностиПриАктивизацииПоля(Элемент)
	
	МассивЭлементовОтбора = Новый Массив;
	МассивЭлементовОтбора.Добавить(Элементы.НачисленияЗадолженностиВидЗадолженности);
	МассивЭлементовОтбора.Добавить(Элементы.НачисленияЗадолженностиКонтрагент);
	МассивЭлементовОтбора.Добавить(Элементы.НачисленияЗадолженностиСчетДоверительногоУправления);
	
	Элементы.НачисленияЗадолженностиКонтекстноеМенюНачисленияЗадолженностиОтбор.Доступность = (МассивЭлементовОтбора.Найти(Элемент.ТекущийЭлемент) <> Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура СфомрироватьСообщение()
	
	МассивЗадолженностей = Новый Массив;
	Для Каждого СтрокаНачисленияЗадолженности Из НачисленияЗадолженности Цикл
		Если СтрокаНачисленияЗадолженности.Выгружать Тогда
			МассивЗадолженностей.Добавить(СтрокаНачисленияЗадолженности.НачислениеЗадолженности);
		КонецЕсли;
	КонецЦикла;	
	
	РеквизитФормыВЗначение("Объект").СфомрироватьСообщение(МассивЗадолженностей);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле Каталог выгрузки", , "КаталогВыгрузки", "Объект");
		Возврат;
	КонецЕсли;	
	
	СфомрироватьСообщение();
	
	Объект.ТекстСообщения.Записать(Объект.КаталогВыгрузки + "/messege.xml", "UTF-8");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПисьмо(Команда)
	
	ОчиститьСообщения();
	
	СфомрироватьСообщение();
	
	ИмяВременногоФайла = КаталогВременныхФайлов() + "/messege.xml";
	
	Объект.ТекстСообщения.Записать(ИмяВременногоФайла, "UTF-8");
	
   Попытка
      Outlook = Новый COMОбъект("Outlook.Application");
   Исключение
   КонецПопытки;
   
   
   Письмо = Outlook.CreateItem(0);
   Письмо.Subject = "Выгрузка начислений задолженности.";
   
   Письмо.Attachments.Add(ИмяВременногоФайла);
   
   Письмо.Display();	
	
	
КонецПроцедуры


#КонецОбласти
